@ftarasenko @ozerovandrei this does not work for me, the provider always performs a forces replacement if flavor_id is not set in the tf file:
`
# openstack_compute_flavor_v2.medium1-2 must be replaced
-/+ resource "openstack_compute_flavor_v2" "medium1-2" {
      - ephemeral    = 0 -> null
      ~ extra_specs  = {} -> (known after apply)
      - flavor_id    = "49f53356-5672-4ccc-823a-be226ee64fd1" -> null # forces replacement
      ~ id           = "49f53356-5672-4ccc-823a-be226ee64fd1" -> (known after apply)
        name         = "medium1-2"
      ~ region       = "nova" -> (known after apply)
      - swap         = 0 -> null
        # (5 unchanged attributes hidden)
    }
`